{
  "meta": {
    "title": "Тест на тип привязанности | Симулятор переписки",
    "description": "Узнайте свой тип привязанности через реалистичные текстовые переписки. Как вы отвечаете на сообщения партнёра?"
  },
  "app": {
    "title": "Тип привязанности",
    "subtitle": "Как вы на самом деле переписываетесь с партнёром?",
    "description": "Ваши привычки в переписке раскрывают ваш тип привязанности. Пройдите 10 реалистичных сценариев, чтобы узнать свой.",
    "badge": "Симулятор чата",
    "info1": "10 чатов",
    "info2": "~3 мин",
    "info3": "4 стиля",
    "disclaimer": "Только для развлечения. Не является клинической диагностикой.",
    "start": "Начать переписку 💬"
  },
  "chat": {
    "partner": "Партнёр",
    "typing": "печатает...",
    "online": "в сети",
    "scenario": "Чат",
    "tapToReply": "Выберите ответ..."
  },
  "scenarios": {
    "s1": {
      "context": "3 часа с момента последнего сообщения",
      "partnerMsg": "Привет, я написал(а) тебе 3 часа назад... всё нормально? 😕",
      "options": {
        "a": "Прости! Был(а) очень занят(а) на работе. Что случилось? 😊",
        "b": "ПРОСТИ, пожалуйста!! Я не хотел(а) тебя игнорировать 😭",
        "c": "Да, видел(а). Просто был(а) занят(а) своими делами.",
        "d": "Прости... я всё время хотел(а) ответить, но не знал(а), что написать"
      }
    },
    "s2": {
      "context": "Вечер вторника",
      "partnerMsg": "Привет... нам нужно кое о чём поговорить сегодня вечером.",
      "options": {
        "a": "Конечно, что у тебя на уме? Я весь(вся) внимание 😊",
        "b": "Ой нет, всё в порядке?? Ты меня пугаешь 😰",
        "c": "Может, просто скажешь сейчас? Не люблю ждать.",
        "d": "...ладно (перечитывает сообщение 5 раз, пытаясь понять тон)"
      }
    },
    "s3": {
      "context": "Случайное дневное сообщение",
      "partnerMsg": "Просто подумал(а) о тебе и хотел(а) сказать, что очень ценю тебя в своей жизни 💕",
      "options": {
        "a": "Это так много значит 🥰 Я чувствую то же самое к тебе!",
        "b": "Правда?? Ты серьёзно? 🥺 Обещаешь?",
        "c": "Ха-ха, спасибо 👍",
        "d": "Это очень мило, спасибо... (набирает и удаляет ответ 3 раза)"
      }
    },
    "s4": {
      "context": "Планы на выходные",
      "partnerMsg": "Мои друзья собираются в субботу. Пойдёшь со мной? 🎉",
      "options": {
        "a": "Звучит круто! Во сколько приходить?",
        "b": "А кто ещё будет? Твой бывший/твоя бывшая там будет? 👀",
        "c": "Дам знать. Возможно, у меня другие планы.",
        "d": "Хочу, но... я плохо чувствую себя в компаниях. Можно уйти пораньше?"
      }
    },
    "s5": {
      "context": "Утро после ссоры",
      "partnerMsg": "Думаю, мы оба вчера наговорили лишнего...",
      "options": {
        "a": "Ты прав(а). Можем сесть и спокойно всё обсудить?",
        "b": "Ты ещё злишься? Я всю ночь думал(а) об этом 😔",
        "c": "Давай просто двигаемся дальше. Зацикливаться не поможет.",
        "d": "Каждая ссора заставляет чувствовать, что всё заканчивается... я не могу так"
      }
    },
    "s6": {
      "context": "Вечерняя переписка",
      "partnerMsg": "Мне нужно побыть одному/одной сегодня. Ничего не случилось, просто нужно подзарядиться 🔋",
      "options": {
        "a": "Конечно! Отдыхай сколько нужно. Я рядом 😊",
        "b": "Я что-то сделал(а) не так? Ты точно не обиделся/обиделась?",
        "c": "Окей, я и сам(а) хотел(а) предложить то же самое.",
        "d": "Хорошо... (а вдруг начинает отдаляться?)"
      }
    },
    "s7": {
      "context": "Поздний вечер",
      "partnerMsg": "У меня был ужасный день... можно мне выговориться? 😞",
      "options": {
        "a": "Конечно. Расскажи всё, я здесь для тебя 💛",
        "b": "Разумеется!! Мне приехать прямо сейчас?? Отменю все дела!",
        "c": "Ладно, но можешь покороче? У меня тоже своих забот хватает.",
        "d": "Да... я хочу помочь, но не уверен(а), что скажу то, что нужно"
      }
    },
    "s8": {
      "context": "Серьёзный разговор",
      "partnerMsg": "Случайный вопрос, но... где ты видишь нас через год? 🤔",
      "options": {
        "a": "Расти вместе, куда бы ни привела жизнь. Разберёмся 😊",
        "b": "Я ПОСТОЯННО думаю о нашем будущем. Очень надеюсь, что у нас получится 🥺",
        "c": "Через год? Это далеко. Давай просто наслаждаться настоящим.",
        "d": "Хочу сказать что-то обнадёживающее, но... боюсь сглазить"
      }
    },
    "s9": {
      "context": "Ситуация в соцсетях",
      "partnerMsg": "Я заметил(а), что ты лайкнул(а) фотки бывшего/бывшей в Инстаграме... 👀",
      "options": {
        "a": "А, это? Просто так. Ты же знаешь, что ты единственный/единственная для меня 💛",
        "b": "Это ничего не значит, клянусь!! Отпишусь прямо сейчас 😫",
        "c": "Это просто соцсети. Не придумывай лишнего.",
        "d": "Ты прав(а), это было бестактно... ты злишься на меня? 😟"
      }
    },
    "s10": {
      "context": "Перед сном",
      "partnerMsg": "Спокойной ночи! Сладких снов 🌙💕 Жду не дождусь завтрашней встречи!",
      "options": {
        "a": "Спокойной ночи! 💛 Завтра не может наступить достаточно быстро!",
        "b": "Спокойной ночи!! Напиши мне СРАЗУ как проснёшься, ладно?? 🥰🥰",
        "c": "Ночи 👋",
        "d": "Ночи... (хотел(а) бы сказать, как много этот человек значит)"
      }
    }
  },
  "results": {
    "secure": {
      "name": "Надёжный",
      "emoji": "🛡️",
      "desc": "У вас надёжный тип привязанности. Вы чувствуете себя комфортно в эмоциональной близости и общаетесь честно. Вы доверяете партнёру, сохраняя здоровые границы. При конфликтах обращаетесь к проблеме прямо и бережно.",
      "traits": ["Здоровые границы", "Честное общение", "Эмоциональная стабильность", "Естественное доверие"],
      "idealPartner": "Вы ладите со всеми типами, но с другим Надёжным партнёром создадите самую здоровую динамику. Также можете стать опорой для Тревожного или Избегающего партнёра.",
      "advice": "У вас отличная интуиция в отношениях! Только помните — выражайте и свои потребности тоже. Быть «стабильным» не значит подавлять свои эмоции."
    },
    "anxious": {
      "name": "Тревожный",
      "emoji": "💓",
      "desc": "У вас тревожный тип привязанности. Вы любите глубоко и невероятно преданны, но несёте постоянный страх быть брошенным/брошенной. Вы сверхчувствительны к переменам настроения партнёра и нуждаетесь в постоянном подтверждении, чтобы чувствовать себя в безопасности.",
      "traits": ["Глубокая эмпатия", "Сильная преданность", "Страх быть брошенным", "Потребность в подтверждении"],
      "idealPartner": "Надёжный партнёр — ваш идеальный выбор. Тот, кто даёт стабильное чувство безопасности и постоянную любовь. С Избегающими будьте осторожны — динамика «тяни-толкай» может усилить тревогу.",
      "advice": "Медленный ответ ≠ угасающая любовь. Когда тревога нарастает, сделайте вдох, прежде чем реагировать. Любовь к себе — фундамент для более здоровых отношений."
    },
    "avoidant": {
      "name": "Избегающий",
      "emoji": "🏔️",
      "desc": "У вас избегающий тип привязанности. Вы цените независимость и свободу. Чрезмерная близость вызывает дискомфорт, но глубокие чувства скрываются за внешней отстранённостью. Вы лучше всего обрабатываете эмоции в своём темпе.",
      "traits": ["Сильная независимость", "Закрытые эмоции", "Потребность в пространстве", "Самодостаточность"],
      "idealPartner": "Надёжный партнёр, который даёт пространство без давления. Тёплый, но терпеливый человек постепенно поможет снизить ваши стены.",
      "advice": "Уязвимость — это не слабость, а мост к более глубокой связи. Попробуйте открываться маленькими дозами. Признавайте эмоциональные потребности партнёра тоже."
    },
    "fearful": {
      "name": "Дезорганизованный",
      "emoji": "🌪️",
      "desc": "У вас дезорганизованный (тревожно-избегающий) тип привязанности. Вы жаждете близости, но одновременно боитесь её. Хотите сблизиться, но отступаете, чтобы защитить себя от боли. Эти «качели» делают отношения эмоциональными «американскими горками».",
      "traits": ["Жажда и страх близости", "Эмоциональные перепады", "Влияние прошлых ран", "Инстинкт самозащиты"],
      "idealPartner": "Терпеливый Надёжный партнёр, который остаётся стабильным несмотря на ваши «качели». Опыт безопасных, стабильных отношений — пусть и медленный — способен всё изменить.",
      "advice": "Ваши противоречивые сигналы идут от самозащиты, а не от замешательства. Не каждые отношения заканчиваются болью. Стройте доверие маленькими шагами. Вы заслуживаете той любви, которой боитесь."
    }
  },
  "result": {
    "yourStyle": "Ваш тип привязанности",
    "chatAnalysis": "Анализ переписки",
    "attachmentLevel": "Спектр привязанности",
    "secondaryType": "Вторичный тип",
    "keyTraits": "Ключевые черты",
    "idealPartner": "Идеальный партнёр",
    "advice": "Совет о любви",
    "retake": "Пройти заново 💬"
  },
  "share": {
    "twitter": "Узнай свой тип привязанности через переписку!",
    "shareX": "Поделиться в X",
    "copyUrl": "Скопировать ссылку",
    "copied": "Ссылка скопирована!"
  },
  "a11y": {
    "skip": "Перейти к содержимому"
  }
}
